In [1]:
%load_ext sql
import pandas as pd
import sqlite3

In [2]:
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [3]:
%%sql
SELECT P1.program_name, C2.course_title,P.name, C.term
FROM COURSE_MEETINGS_FACTS AS C
LEFT JOIN PROFESSOR_DIMENSION AS P USING(professor_id)
LEFT JOIN PROGRAMS_DIMENSION AS P1 USING(program_id)
LEFT JOIN COURSE_CAT_DIMENSION AS C2 USING(cat_id)
WHERE P1.program_code LIKE '%AC%' AND C.term LIKE '%Fall2017%'
GROUP BY course_title, name
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Accounting', 'Accounting Information Systems', 'Scott M  Brenner', 'Fall2017'),
 ('Accounting', 'Accounting Information for Decision-Making', 'Michael P.  Coyne', 'Fall2017'),
 ('Accounting', 'Advanced Accounting', 'Patricia M.  Poli', 'Fall2017'),
 ('Accounting', 'Auditing', 'David L.  Glinka', 'Fall2017'),
 ('Accounting', 'Auditing', 'Paul   Caster', 'Fall2017'),
 ('Accounting', 'Cost Management', 'Bruce   Bradford', 'Fall2017'),
 ('Accounting', 'Cost Management Lab', 'Bruce   Bradford', 'Fall2017'),
 ('Accounting', 'Federal Income Taxation I', 'David J.  Orticelli', 'Fall2017'),
 ('Accounting', 'Federal Income Taxation I', 'Jo Ann   Drusbosky', 'Fall2017'),
 ('Accounting', 'Intermediate Accounting I', 'Milo W.  Peck', 'Fall2017')]

In [4]:
%%sql 
SELECT L.location, day, start, end, cap
FROM COURSE_MEETINGS_FACTS
LEFT JOIN LOCATION_DIMENSION AS L USING (location_id)
WHERE L.location LIKE '%DSB 111%'
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('DSB 111', 'R', '2014-09-04T11:00:00', '2014-09-04T12:15:00', 0),
 ('DSB 111', 'M', '2014-09-08T11:00:00', '2014-09-08T12:15:00', 0),
 ('DSB 111', 'R', '2014-09-11T11:00:00', '2014-09-11T12:15:00', 0),
 ('DSB 111', 'M', '2014-09-15T11:00:00', '2014-09-15T12:15:00', 0),
 ('DSB 111', 'R', '2014-09-18T11:00:00', '2014-09-18T12:15:00', 0),
 ('DSB 111', 'M', '2014-09-22T11:00:00', '2014-09-22T12:15:00', 0),
 ('DSB 111', 'R', '2014-09-25T11:00:00', '2014-09-25T12:15:00', 0),
 ('DSB 111', 'M', '2014-09-29T11:00:00', '2014-09-29T12:15:00', 0),
 ('DSB 111', 'R', '2014-10-02T11:00:00', '2014-10-02T12:15:00', 0),
 ('DSB 111', 'M', '2014-10-06T11:00:00', '2014-10-06T12:15:00', 0)]

In [5]:
%%sql
SELECT DISTINCT C1.course_title, c.act,c.term
FROM COURSE_MEETINGS_FACTS AS C
LEFT JOIN PROFESSOR_DIMENSION AS P USING (professor_id)
LEFT JOIN COURSE_CAT_DIMENSION AS C1 USING (cat_id)
WHERE P.name LIKE 'Michael P.  Coyne%'
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(None, 31, 'Fall2014'),
 (None, 32, 'Fall2015'),
 (None, 35, 'Fall2015'),
 (None, 36, 'Fall2015'),
 (None, 27, 'Fall2016'),
 (None, 10, 'Fall2016'),
 (None, 16, 'Fall2016'),
 ('Introduction to Financial Accounting', 30, 'Fall2017'),
 ('Accounting Information for Decision-Making', 16, 'Fall2017'),
 ('Introduction to Financial Accounting', 28, 'Fall2018')]

In [6]:
%%sql 
SELECT DISTINCT C1.catalog_id, C.act, C.term
FROM COURSE_MEETINGS_FACTS AS C
LEFT JOIN COURSE_CAT_DIMENSION AS C1 USING (cat_id)
WHERE C1.course_title LIKE '%Costume Design%'
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('TA 0253', 2, 'Fall2017')]

In [7]:
%%sql
SELECT DISTINCT C2.crn,C1.course_title, P.name AS 'Professor', C.term
FROM COURSE_MEETINGS_FACTS AS C
JOIN COURSE_CAT_DIMENSION AS C1 USING (cat_id)
JOIN PROFESSOR_DIMENSION AS P USING (professor_id)
JOIN COURSES_DIMENSION AS C2 USING (course_dimension_id)
WHERE C.term LIKE '%Fall2018%' AND P.name LIKE '%Christopher%'
LIMIT 100;

 * sqlite:///CourseDataWarehouse.db
Done.

[('74015', 'Texts and Contexts I: Writing as Craft and Inquiry', 'Christopher Grant  Madden', 'Fall2018'),
 ('74027', 'Texts and Contexts I: Writing as Craft and Inquiry', 'Christopher   DiBiase', 'Fall2018'),
 ('74314', 'Texts and Contexts I: Writing as Craft and Inquiry', 'Christopher Grant  Madden', 'Fall2018'),
 ('74317', 'Texts and Contexts I: Writing as Craft and Inquiry', 'Christopher   DiBiase', 'Fall2018'),
 ('74413', 'Texts and Contexts I: Writing as Craft and Inquiry', 'Christopher   DiBiase', 'Fall2018'),
 ('74287', 'Elementary Italian I', 'Federica   Christopher', 'Fall2018'),
 ('74288', 'Elementary Italian I', 'Federica   Christopher', 'Fall2018'),
 ('74289', 'Elementary Italian I', 'Federica   Christopher', 'Fall2018'),
 ('75155', 'Concepts of Calculus', 'Christopher R.  Bernhardt', 'Fall2018'),
 ('75858', 'Concepts of Calculus', 'Christopher R.  Bernhardt', 'Fall2018'),
 ('74977', 'Applied Calculus I', 'Christopher   Staecker', 'Fall2018'),
 ('74810', 'Functional Programming', 'Christopher   Staecker', 'Fall2018'),
 ('75487', 'Calculus I', 'Christopher R.  Bernhardt', 'Fall2018'),
 ('74980', 'Real Analysis', 'Christopher   Staecker', 'Fall2018'),
 ('74215', 'Operations Management', 'Christopher L.  Huntley', 'Fall2018'),
 ('74216', 'Operations Management', 'Christopher L.  Huntley', 'Fall2018')]